;=========================================
; 記号入力関連のショートカット
;=========================================
; F13キーと組み合わせて各種記号を入力するためのショートカット設定
; 入力しづらい記号をより簡単に入力できるようにカスタマイズ

; ダブルクォート (") の入力
F13 & 7::Send '""'                  ; F13 + 7 で " を入力

; 角括弧・波括弧の入力
F13 & 8:: {                         ; F13 + 8 で [ または { を入力
    if GetKeyState("Shift") {       ; 
        Send "{{}"                  ; Shift + F13 + 8 -> {
        return
    }
    Send "{[}"                      ;         F13 + 8 -> [
}

F13 & 9:: {                         ; F13 + 9 で ] または } を入力
    if GetKeyState("Shift") {       ; 
        Send "{}}"                  ; Shift + F13 + 9 -> }
        return
    }
    Send "{]}"                      ;         F13 + 9 -> ]
}


